app/views/dashboard/index.html.erb


<%= pie_chart Orcamento.where("status != " "'9. Finalizado'").group(:status).count, id: "pie_status" ,legend: "left"%>
---
SELECT "orcamentos".* FROM "orcamentos" WHERE (status != '9. Finalizado')
SELECT COUNT(*) AS count_all, "orcamentos"."status" AS orcamentos_status FROM "orcamentos" WHERE (status != '9. Finalizado') GROUP BY "orcamentos"."status"