app/views/orcamentos/show.html.erb

          <%if @current_user.cargo == "mecanico"%>
              <% @orcamento.peca_orc.each do |peca_orc| %>
---
SELECT "peca_orcs".* FROM "peca_orcs" WHERE "peca_orcs"."orcamento_id" = $1  [["orcamento_id", 1]]

            <%if @current_user.cargo == "mecanico"%>
              <% @orcamento.servico_orc.each do |servico_orc| %>
---
SELECT "servico_orcs".* FROM "servico_orcs" WHERE "servico_orcs"."orcamento_id" = $1  [["orcamento_id", 1]]