app/controllers/dashboard_controller.rb

SELECT "orcamentos".* FROM "orcamentos" WHERE (status != '9. Finalizado')
---
	def index
	@orc = Orcamento.where("status != " "'9. Finalizado'")