app/controllers/financeiro_controller.rb

def busca_despesa

  fornecedor = params[:fornecedor]
  datai = params[:datai]
  dataf = params[:dataf]
  @pecat = Peca.joins(:peca_orc, :fornecedor).where("peca_orcs.CREATED_AT BETWEEN TO_DATE(""'#{datai}'"",'DD-MM-YYYY') AND  TO_DATE(""'#{dataf}'"",'DD-MM-YYYY')").group("fornecedors.nome_fornecedor, pecas.id")
  @pecaorc = PecaOrc.where "CREATED_AT BETWEEN TO_DATE(" "'#{datai}'" ",'DD-MM-YYYY') AND  TO_DATE(""'#{dataf}'"",'DD-MM-YYYY')"
---
SELECT "pecas".* FROM "pecas" INNER JOIN "peca_orcs" ON "peca_orcs"."peca_id" = "pecas"."id" INNER JOIN "fornecedors" ON "fornecedors"."id" = "pecas"."fornecedor_id" WHERE (peca_orcs.CREATED_AT BETWEEN TO_DATE('01/01/2019','DD-MM-YYYY') AND  TO_DATE('01/03/2019','DD-MM-YYYY')) GROUP BY fornecedors.nome_fornecedor, pecas.id
SELECT "peca_orcs".* FROM "peca_orcs" WHERE (CREATED_AT BETWEEN TO_DATE('01/01/2019','DD-MM-YYYY') AND  TO_DATE('01/03/2019','DD-MM-YYYY'))