app/controllers/orcamentos_controller.rb

SELECT "servicos".* FROM "servicos"
SELECT "peca_orcs".* FROM "peca_orcs" WHERE "peca_orcs"."orcamento_id" = $1  [["orcamento_id", 1]]
---
  def show
  @pecaa = PecaOrc.new
  @servico_orc = Servico.all
  @pecas_orc = Peca.all
  @busca_pre_orc = PreOrc.where "orcamento_id = ?", params[:id]

SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT  "veiculos".* FROM "veiculos" WHERE "veiculos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "orcamentos" ("status", "quilometragem", "valor_total", "cliente_id", "veiculo_id", "created_at", "updated_at", "ocorrencia", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    if params[:veiculo_id] != nil
    @orcamento = Orcamento.new(orcamento_params)
    @orcamento.valor_total = 0
    @orcamento.user_id = 0
    @orcamento.cliente_id = Veiculo.find(params[:veiculo_id]).cliente_id
    @orcamento.veiculo_id = params[:veiculo_id]
    if @orcamento.save

SELECT "orcamentos".* FROM "orcamentos" WHERE (status = '1. Análise')
---
  def busca_orcamento_status

  status = params[:orcamento] [:status]
  if status != ""
      @orc = Orcamento.where "status = " "'#{status}'"

SELECT "orcamentos".* FROM "orcamentos" WHERE (status = '200' and cliente_id in (select cliente_id from cliente_fs where nome like '%CHR%'))
---
  def busca_orcamento
    @selec =  params[:orcamento] [:selec]
    nome =  params[:nome]
    if @selec == "Nome"
     str = "status = " "'#{status}'" " and cliente_id in (select cliente_id from cliente_fs where " "nome like " "'%#{nome}%')"
     str2 = "cliente_id in (select cliente_id from cliente_fs where " "nome like " "'%#{nome}%')"
    elsif @selec == "Razao Social"
     str = "status = " "'#{status}'" " and cliente_id in (select cliente_id from cliente_js where " "razao_social like " "'%#{nome}%')"
     str2 = "cliente_id in (select cliente_id from cliente_js where " "razao_social like " "'%#{nome}%')"
    end
    status = params[:orcamento] [:status]

    if status != "" && @selec != "" #Se os dois for preenchido
    @orc = Orcamento.where str

SELECT  "peca_orcs".* FROM "peca_orcs" WHERE "peca_orcs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit_peca_orc
  @peca_edit = PecaOrc.find(params[:id])

SELECT  "servico_orcs".* FROM "servico_orcs" WHERE "servico_orcs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def edit_serv_orc
  @servico_edit = ServicoOrc.find(params[:id])

SELECT  "orcamentos".* FROM "orcamentos" WHERE "orcamentos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def status_orcamento_js
  @orc = Orcamento.find(params[:id])

SELECT  "orcamentos".* FROM "orcamentos" WHERE "orcamentos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "orcamentos" SET "status" = $1, "updated_at" = $2 WHERE "orcamentos"."id" = $3  [["status", "9. Finalizado"], ["updated_at", "2018-08-31 11:03:32.489069"], ["id", 1]]
---
  def status_orcamento
    status = params[:orcamento] [:status]
    orc = Orcamento.find(params[:id])
    orc.status = status
    orc.save

UPDATE "orcamentos" SET "user_id" = $1, "updated_at" = $2 WHERE "orcamentos"."id" = $3  [["user_id", 2], ["updated_at", "2018-08-31 11:07:46.990180"], ["id", 1]]
---
  def seta_user
    set_orcamento
    logged_in?
    @orcamento.user_id = @current_user.id
    @orcamento.save

SELECT  "orcamentos".* FROM "orcamentos" WHERE "orcamentos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_orcamento
      @orcamento = Orcamento.find(params[:id])