app/controllers/pre_orc_controller.rb

  def inclui_pre_peca
    pre = PreOrc.new
    orc_id = params[:id]
    pre.orcamento_id = orc_id
    pre.descricao = params[:descricao]
    pre.valor = params[:valor]
    pre.save
    @busca_pre_orc =  PreOrc.where "orcamento_id = ?", orc_id
---
INSERT INTO "pre_orcs" ("descricao", "valor", "orcamento_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["descricao", "zxcz"], ["valor", 123], ["orcamento_id", 1], ["created_at", "2019-01-13 01:06:51.034597"], ["updated_at", "2019-01-13 01:06:51.034597"]]
SELECT "pre_orcs".* FROM "pre_orcs" WHERE (orcamento_id = '1')

  def destroy
      pre = PreOrc.find(params[:id])
      pre.destroy
---
SELECT  "pre_orcs".* FROM "pre_orcs" WHERE "pre_orcs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "pre_orcs" WHERE "pre_orcs"."id" = $1  [["id", 3]]