app/controllers/report_controller.rb

SELECT "pre_orcs".* FROM "pre_orcs" WHERE (orcamento_id = '1')
SELECT  "orcamentos".* FROM "orcamentos" WHERE "orcamentos"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
	def pre_orcamento
		@busca_pre_orc = PreOrc.where "orcamento_id = ?", params[:id]
		@orcamento = Orcamento.find(params[:id])

SELECT  "orcamentos".* FROM "orcamentos" WHERE "orcamentos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def orcamento
		@orcamento = Orcamento.find(params[:id])